---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTableIterator.Dispose
source: html/f05a67ab-e5ec-dfc1-e7eb-4121b8714d48.htm
---
# Autodesk.Revit.DB.ExportPatternTableIterator.Dispose Method

Releases all resources used by the ExportPatternTableIterator

## Syntax (C#)
```csharp
public void Dispose()
```